function [ F ] = Legalization( F )
%UNTITLED6 此处显示有关此函数的摘要
%   把不合法的序列改为合法序列
%特征约束。
lo = length(F);
ST = zeros(lo,lo);
ST(2:20,1) = 1;
ST(4,5) = 1;ST(7,5) = 1;
ST(12,6) = 1;ST(13,6) = 1;ST(14,6) = 1;
ST(8,7) = 1;ST(9,7) = 1;ST(10,7) = 1;
ST(12,11) = 1;ST(13,11) = 1;ST(14,11) = 1;
ST(15,12) = 1;ST(16,12) = 1;ST(19,12) = 1;ST(20,12) = 1;
ST(15,13) = 1;ST(16,13) = 1;ST(19,13) = 1;ST(20,13) = 1;
ST(15,14) = 1;ST(16,14) = 1;ST(19,14) = 1;ST(20,14) = 1;
ST(12,2) = 1;ST(13,2) = 1;ST(14,2) = 1;ST(15,2) = 1;ST(16,2) = 1;
ST(4,18) = 1;ST(17,18) = 1;
ST(9,8) = 1;ST(10,8) = 1;ST(10,9) = 1;
ST(13,12) = 1;ST(14,12) = 1;
ST(14,13) = 1;
ST(16,15) = 1;
ST(20,19) = 1;

ST(22,21) = 1;
ST(21:35,36) = 1;
ST(28,26) = 1;
ST(28,27) = 1;
ST(35,34) = 1;
ST(28,29) = 1;
ST(30,32) = 1;
ST(33,31) = 1;
ST(35,34) = 1;
ST(24,23) = 1;
ST(27,26) = 1;

ST(38:50,37) = 1;
ST(39:50,38) = 1;
ST(43,45) = 1;ST(43,46) = 1;ST(43,47) = 1;
ST(44,45) = 1;ST(44,46) = 1;ST(44,47) = 1;
ST(48,39) = 1;ST(49,39) = 1;ST(50,39) = 1;
ST(48,40) = 1;ST(49,40) = 1;ST(50,40) = 1;
ST(48,41) = 1;ST(49,41) = 1;ST(50,41) = 1;
ST(48,42) = 1;ST(49,42) = 1;ST(50,42) = 1;
ST(46,45) = 1;ST(46,45) = 1;
ST(47,46) = 1;
ST(49,48) = 1;

for i = 1:lo
    flag = 1;
    num = F(i);%获取当前的值
%     F(i)
    while(1)
        St = ST(num,:);%
        S1 = find(St == 1);%获取当前特征的约束数组 
        long = length(S1);%当前约束数组的长度。
        if long ~= 0 %如果有约束   
            num = S1(1);
        else%如果没有约束了：交换两者，然后把约束列变为0。
            a = find(F == num);
            [F(i),F(a)] = Swap(F(i),F(a));
%             [M(i),M(a)] = Swap(M(i),M(a));因为小数编码方式与之前不同，所以不用交换机器
            ST(:,num) = 0;
            flag = 0;
        end
        if(flag == 0) % 从while中跳出来
            break;
        end
    end %end_while
end

end


